Ports/jdk/jdk-jdk-18-10/test/jaxp/javax/xml/jaxp/unittest/stream/XMLStreamReaderTest/UTF8-BOM.xml.data

<ns0:Envelope xmlns:nasp="urn:hl7-org:v3" xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/"><ns0:Header><nasp:naspHeader type="Message"><nasp:id root="aa910964-898e-4802-8f6e-d1be452639cd"></nasp:id><nasp:interactionId root="2.16.840.1.113883.2.1.3.2.4.12" extension="QUPA_IN010000UK01"></nasp:interactionId><nasp:communicationFunctionRcv type="CommunicationFunction" typeCode="RCV"><nasp:device type="Device" classCode="DEV" determinerCode="INSTANCE"><nasp:id root="2.16.840.1.113883.2.1.4.11" extension="NASPTestEndpoint"></nasp:id></nasp:device></nasp:communicationFunctionRcv><nasp:communicationFunctionSnd type="CommunicationFunction" typeCode="SND"><nasp:device type="Device" classCode="DEV" determinerCode="INSTANCE"><nasp:id root="2.16.840.1.113883.2.1.4.11" extension="F81079-00093"></nasp:id></nasp:device></nasp:communicationFunctionSnd><nasp:ControlActProcess type="ControlAct" classCode="CACT" moodCode="RQO"><nasp:author type="Participation" typeCode="AUT"><nasp:assignedEntity type="RoleHeir" classCode="ASSIGNED"><nasp:representedOrganization type="Organization" classCode="ORG" determinerCode="INSTANCE"></nasp:representedOrganization></nasp:assignedEntity></nasp:author></nasp:ControlActProcess></nasp:naspHeader></ns0:Header><ns0:Body><m:QUPA_IN010000UK01 xsi:schemaLocation="urn:hl7-org:v3 ../Schemas/QUPA_IN010000UK01.xsd" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/" xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="urn:hl7-org:v3"><m:id root="11111112-65D4-EC43-BC31-62522532BC6E" /><m:creationTime value="200405051115" /><m:versionCode code="V3NPfIT2.0" /><m:interactionId root="2.16.840.1.113883.2.1.3.2.4.12" extension="QUPA_IN010000UK01" /><m:processingCode code="P" /><m:processingModeCode code="T" /><m:acceptAckCode code="NE" /><m:communicationFunctionRcv><m:device><m:id root="2.16.840.1.113883.2.1.4.11" extension="NASP" /><m:id root="2.16.840.1.113883.2.1.4.10" extension="100000000900001" /></m:device></m:communicationFunctionRcv><m:communicationFunctionSnd><m:device><m:id root="2.16.840.1.113883.2.1.4.11" extension="ISOFT_001_001" /><m:id root="2.16.840.1.113883.2.1.4.10" extension="100000000800001" /></m:device></m:communicationFunctionSnd><m:ControlActProcess xsi:schemaLocation="urn:hl7-org:v3 ../Schemas/QUPA_MT010101UK02.xsd" classCode="CACT" moodCode="RQO" xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:msg="urn:hl7-org:v3/mif" xmlns:voc="urn:hl7-org:v3/voc"><m:author typeCode="AUT"><m:assignedEntity classCode="ASSIGNED"><m:id root="2.16.840.1.113883.2.1.4.4" extension="G0000017" /><m:code code="011" /><m:representedOrganization classCode="ORG" determinerCode="INSTANCE"><m:id root="2.16.840.1.113883.2.1.4.3" extension="Z99993" /><m:code code="001" /></m:representedOrganization></m:assignedEntity></m:author><m:pdsTraceQuery><m:queryId root="BBBBQ01B-A9D1-A411-F824-9F7A00A33757" /><m:person.address><m:value use="H"><m:addressKey> 12345678 </m:addressKey></m:value><m:semanticsText>person.address</m:semanticsText></m:person.address><m:person.administrativeGenderCode><m:value code="2" /><m:semanticsText>person.administrativeGenderCode</m:semanticsText></m:person.administrativeGenderCode><m:person.birthTime><m:value value="19810303" /><m:semanticsText>person.birthTime</m:semanticsText></m:person.birthTime><m:person.name><m:value use="L"><m:given>Matthew</m:given><m:family>Barrow</m:family></m:value><m:semanticsText>person.name</m:semanticsText></m:person.name></m:pdsTraceQuery></m:ControlActProcess></m:QUPA_IN010000UK01></ns0:Body></ns0:Envelope>
